---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StairsRailingBalusterPlacement
source: html/6b3af3b5-cc1c-8221-ed8c-44c7f27f31d4.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StairsRailingBalusterPlacement Property

"Baluster Placement"

## Syntax (C#)
```csharp
public static ForgeTypeId StairsRailingBalusterPlacement { get; }
```